src_simulation/DataProcessors/ОбменWMS.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ОбменWMS</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src_simulation/Documents/ПриходныйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПриходныйОрдер</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_simulation/Documents/РасходныйОрдер.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>РасходныйОрдер</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_simulation/Documents/Списание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Списание</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src_simulation/DataProcessors/ОбменWMS/Ext/ObjectModule.bsl
Процедура ВыполнитьОбменWMS() Экспорт
	ГСЧ = Новый ГенераторСлучайныхЧисел();  
	КолД =  ГСЧ.СлучайноеЧисло(0, 10); 
	
	Если Константы.КоличествоНоменклатуры.Получить()<100 Тогда
		ВыгрузитьНоменклатуру(101);
	КонецЕсли;     
	
	МассивМарок = Новый Массив;
	
	
	Для счетчик = 1 По КолД Цикл
		
		ТипД = ГСЧ.СлучайноеЧисло(0, 2);   
		Если ТИпД= 0 Тогда
			док = Документы.ПриходныйОрдер.СоздатьДокумент(); 
			ТипДок = "ПриходныйОрдер";
		ИначеЕсли ТИпД= 1 Тогда
			док = Документы.РасходныйОрдер.СоздатьДокумент(); 
			ТипДок ="РасходныйОрдер";
		Иначе
			док = Документы.Списание.СоздатьДокумент();     
			ТипДок = "Списание";
		КонецЕсли;  
		
		
		
		Док.Дата = ТекущаядатаСеанса();
		Док.УстановитьНовыйНомер();
		КолН = ГСЧ.СлучайноеЧисло(1, 10);   
		Для цик= 1 по КолН Цикл
			стр = Док.Товары.Добавить();
			стр.Номенклатура = ПолучитьНоменклатуру();  
			стр.Количество = ГСЧ.СлучайноеЧисло(1, 10);     
			стр.Цена = ГСЧ.СлучайноеЧисло(1, 10);
			стр.Сумма = стр.Количество * стр.Цена;
		КонецЦикла;
		
		Док.Записать();
		ИдДок = Строка(Док.Ссылка.УникальныйИдентификатор());
		
		Для каждого стр из док.Товары Цикл 
			ИдНом = Строка(стр.Номенклатура.УникальныйИдентификатор());
			Для номерМарки = 1 По стр.Количество Цикл                
				строкаМарка = Новый Структура("TipD, IdDok, IdNom, Marka", ТипДок, ИдДок, ИдНом, ГенерацияСлучайнойСтроки(20));  
				МассивМарок.Добавить(СтрокаМарка);
			КонецЦикла;	
		КонецЦикла;
	КонецЦикла;
	обр = обработки.РаботаСKafkaЧерезВК.Создать();
	обр.ВыгрузитьМарки(МассивМарок);
КонецПроцедуры  

Процедура ВыгрузитьНоменклатуру(Кол=100) Экспорт
	КН = Константы.КоличествоНоменклатуры.Получить();
	МасН = Новый Массив;
	Для цик = КН по КН+Кол Цикл
		Ном = СоздатьНоменклатуру(цик);
		масН.Добавить(Ном);
	КонецЦикла;
	Константы.КоличествоНоменклатуры.Установить(КН+кол+1);  
	обр = обработки.РаботаСKafkaЧерезВК.Создать();
	обр.ВыгрузитьНоменклатуру(МасН);
КонецПроцедуры  

Функция СоздатьНоменклатуру(КН) 
	Ном = Справочники.Номенклатура.СоздатьЭлемент(); 
	Ном.Наименование = Строка(КН) + ГенерацияСлучайнойСтроки(10);
	Ном.Код = Строка(КН);
	Ном.Записать();
	Возврат ном.Ссылка;
КонецФункции

Функция ГенерацияСлучайнойСтроки(КС)
	ГСЧ = Новый ГенераторСлучайныхЧисел();    
	СлучайнаяСтрока = "";
	// генерируем случайное число из 6-ти символов, например "d0c8Yf"
	Для Сч = 1 по КС Цикл        
		Набор = ГСЧ.СлучайноеЧисло(1,3);    
		Если Набор = 1 Тогда
			// это число
			СлучайныйСимвол = ГСЧ.СлучайноеЧисло(0,9);    
		ИначеЕсли Набор = 2 Тогда
			// это Большая буква латиницы
			СлучайныйСимвол = Символ(ГСЧ.СлучайноеЧисло(65,90));
		ИначеЕсли Набор = 3 Тогда
			// это маленькая буква латиницы
			СлучайныйСимвол = Символ(ГСЧ.СлучайноеЧисло(97,122));
		КонецЕсли;
		СлучайнаяСтрока = СлучайнаяСтрока + СлучайныйСимвол;
	КонецЦикла;      
	Возврат(СлучайнаяСтрока);    
КонецФункции     


Функция ПолучитьНоменклатуру()   
	Пока истина Цикл	
		ГСЧ = Новый ГенераторСлучайныхЧисел();
		НомН = ГСЧ.СлучайноеЧисло(0, Константы.КоличествоНоменклатуры.Получить()-1);  
		Ном = Справочники.Номенклатура.НайтиПоКоду(Строка(НомН));
		Если ЗначениеЗаполнено(Ном) Тогда
			Возврат ном;
		КонецЕсли;
	КонецЦикла;
КонецФункции
